package home_work_1;

public class BitwiseSecond {
    public static void main(String[] args) {
        int a = -42;//11111111_11111111_11111111_11010110
        int b = -15;//11111111_11111111_11111111_11110001

        int c = ~a;//00000000_00000000_00000000_00101001
        int d = ~b;//00000000_00000000_00000000_00001110
        System.out.println(c);//41
        System.out.println(d);//14
        int e = a & b;//11111111_11111111_11111111_11010000
        System.out.println(e);//-48
        int f = a | b;//11111111_11111111_11111111_11110111
        System.out.println(f);//-9
        int g = a^b;//00000000_00000000_00000000_00100111
        System.out.println(g);//39
        int h = a>>2;//11111111_11111111_11111111_11110101
        System.out.println(h);//-11
        int i = b<<2;//11111111_11111111_11111111_11000100
        System.out.println(i);//-60
        int j = a>>>1;//1111111_11111111_11111111_11101011
        System.out.println(j);//2147483627

        a &= b;//11111111_11111111_11111111_11010000
        System.out.println(a);//-48
        a |= b;//11111111_11111111_11111111_11110001
        System.out.println(a);//-15
        a ^= b;//00000000_00000000_00000000_00000000
        System.out.println(a);//0
        b >>= 2;//11111111_11111111_11111111_11111100
        System.out.println(b);//-4
        b <<= 2;//11111111_11111111_11111111_11110000
        System.out.println(b);//-16

        /*
        Побитовые операции с числом 42,5 невозможны, так как работают только с целочисленными типами
         */
    }
}
